back-end/app/controllers/boards_controller.rb

    def index
        boards = Board.all
---
SELECT "boards".* FROM "boards"

    def create
        board = Board.create(name: params[:name])
---
INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-01-27 19:14:00.776550"], ["updated_at", "2021-01-27 19:14:00.776550"]]