back-end/app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
    def index
        lists = List.all

INSERT INTO "lists" ("name", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asdsad"], ["board_id", 1], ["created_at", "2021-01-26 18:23:59.621104"], ["updated_at", "2021-01-26 18:23:59.621104"]]
---
    def create
        list = List.create(name: params[:name], board_id: 1)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
    def destroy
        list = List.find(params[:id])
        list.destroy()