back-end/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hi"], ["list_id", 1], ["created_at", "2021-01-26 23:29:54.548239"], ["updated_at", "2021-01-26 23:29:54.548239"]]
---
        task = Task.create(name: params[:name], list_id: params["list_id"])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
        task = Task.find_by(id: params["id"])
        task.destroy()